app/controllers/drinks_controller.rb

  def index
    @drinks = Drink.includes(:category).all
---
SELECT "drinks".* FROM "drinks"

  def create
    @drink = Drink.new(drink_params)

    respond_to do |format|
      if @drink.save
---
INSERT INTO "drinks" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Cafe"], ["created_at", 2016-09-13 01:01:13 UTC], ["updated_at", 2016-09-13 01:01:13 UTC]]

  def update
    respond_to do |format|
      if @drink.update(drink_params)
---
UPDATE "drinks" SET "category_id" = ?, "updated_at" = ? WHERE "drinks"."id" = ?  [["category_id", 1], ["updated_at", 2016-09-14 02:58:36 UTC], ["id", 1]]

    def set_drink
      @drink = Drink.find(params[:id])
---
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]