app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "David"], ["last_name", "Cortes"], ["email", "dcortes22@gmail.com"], ["created_at", 2016-09-13 00:28:47 UTC], ["updated_at", 2016-09-13 00:28:47 UTC]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "Cortes Saenz"], ["updated_at", 2016-09-13 00:29:43 UTC], ["id", 1]]